Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིན་ཅི་ལོག་ལས་ཤིན་ཏུ་འདས་པ་དང་། འདུ་ཤེས་དང་སེམས་དང་ལྟ་བའི་ཕྱིན་ཅི་ལོག་ལས་ཡོངས་སུ་འདས་པ་དང་། རྨྱི་ལམ་ལྟ་བུའི་འཇིག་རྟེན་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡ་ཤེས་ཀྱིས་ཁོང་དུ་ཆུད་པ་དང་། སྒྱུ་མ་ལྟ་བུའི་འཇིག་རྟེན་ཐམས་ཅད་རབ་ཏུ་རྟོགས་པ་དང་། སེམས་ཅན་མྱེད་པའི་ཡེ་ཤེས་ཀྱི་དབྱིངས་རབ་ཏུ་ཐོབ་པ་དང་། ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་རབ་ཏུ་མཐོང་བས་སྙིང་རྗེའི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཡངས་པ་དང་སྨོན་ལམ་ཆེན་པོའི་སྟོབས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བའི་དོན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པར་སྣང་ངོ་།
en: Because bodhisattvas have transcended error, have transcended erroneous perception, mentation, and views, have comprehend all worlds to be like dreams, realize all worlds to be like magical conjurations, have attained the realm of the wisdom that there are no beings, view all phenomena exactly as they truly are, and, through the power of the vast domain of compassion and of great prayers, appear to all beings in order to ripen and guide all beings.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན། ཆུ་ཀླུང་ཆེན་པོ་ལ་སྩོགས་པ་ལ་གྲུ་ནི་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སེམས་ཅན་ཡོངས་སུ་བསྒྲལ་བ་ལ་བརྩོན་པ་སྟེ། ནམ་མ་ཞིགས་ཀྱི་བར་དུ་རྒྱུན་གཅོད་པ་མེད་ཀྱང་།
en: “Noble one, it is like the analogy of a ship on a great river, and so on, which is continuously engaged in ferrying beings across.

source: དེ་ལ་ཕ་རོལ་གྱི་ངོགས་ལ་མངོན་པར་ཆགས་པ་མེད། ཚུ་རོལ་གྱི་ངོགས་ལའང་མངོན་པར་ཆགས་པ་མེད། ཆུའི་དབུས་ནའང་གནས་པ་མེད་དོ།
en: It does not stay at the opposite shore, it does not stay at the near shore, and it does not remain in between.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆེན་པོའི་གྲུའི་མཐུས་འཁོར་བའི་ཆུ་ཀླུང་གི་རྒྱུད་ལས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྒྲལ་བ་ལ་ཞུགས་པ་ཡིན་ཏེ། དེ་ལ་ཚུ་རོལ་གྱི་མུས་འཇིགས་པ་མེད་དོ། །ཕ་རོལ་གྱི་མུར་བདེ་བར་འགྱུར་བའི་འདུ་ཤེས་མེད་དོ།
en: “Noble one, in the same way, bodhisattvas, through the power of the ship of the great perfections, are engaged in ferrying beings across the flow of the river of saṃsāra, doing so without fear of the near shore and without a conception of the bliss of the far shore.

source: །འོན་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསྐལ་པ་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་དུ་གནས་པར་བྱ་བར་ཞེ་ནོན་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྒྲལ་བར་བྱ་བ་ལ་ཞུགས་པ་ཡིན་ཏེ། བསྐལ་བའི་རྣམ་པར་ཐ་དད་པ་ལ་མངོན་པར་ཞེན་པ་མེད་དོ།
en: Yet they are continuously engaged in the practice of bringing all beings to liberation while maintaining bodhisattva conduct throughout countless kalpas without attachment to the different kinds of kalpas.

source: །བསྐལ་པ་འདའ་བར་བྱ་བ་ལ་རིང་བའི་འདུ་ཤེས་སུ་གྱུར་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པ་མ་ཡིན་ནོ།
en: They do not practice bodhisattva conduct with the perception that the passing of a kalpa is a long time.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན། ཆོས་ཀྱི་དབྱིངས་ལྟར་ཡངས་པའི་ནམ་མཁའི་དབྱིངས་ནམ་མཁའི་གཞིའི་དཀྱིལ་འཁོར་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་འདུའམ་འཇིག་གམ་འདས་པར་གྱུར་ཀྱང་རྣམ་པར་རྟོག་པ་མེད་ཅིང་རང་བཞིན་གྱིས་རྣམ་པར་དག་ལ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དེ། འཁྲུག་པ་མེད་ཅིང་བསྒྲིབས་པ་མེད་ལ་ཕྱི་མའི་མཐའི་དུས་སུ་ཞིང་ཐམས་ཅད་འཛིན་ཀྱང་ཡོངས་སུ་སྐྱོ་བ་མེད་དོ།
en: “Noble one, it is like the analogy of the realm of space that is the domain of the sky, the vast realm of phenomena, which though it includes the creation, destruction, and passing of all world realms is without thought and is naturally pure and completely undefiled, undisturbed, unobscured, and unwearied by possessing all realms throughout all future time.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཡེ་ཤེས་ནམ་མཁའི་དཀྱིལ་འཁོར་ཀྱང་སྨོན་ལམ་ཆེན་པོའི་རླུང་གི་དཀྱིལ་འཁོར་གྱིས་ཀུན་ནས་བསྐོར་ཅིང་ངན་སོང་གི་གཡང་ས་ཐམས་ཅད་ལས་སེམས་ཅན་ཡོངས་སུ་འཛིན་ཀྱང་ཡོངས་སུ་སྐྱོ་བ་མེད་དོ།
en: “Noble one, in the same way, the domain of the space of the wisdom of bodhisattvas’ aspiration, with the revolving of the circle of the wind of great prayers, holds back beings from all the abysses of the lower existences without ever wearying;

source: །བདེ་བའི་ལམ་ལ་འགོད་པ་བྱེད་ཀྱང་ཡོངས་སུ་སྒྱིད་ལུག་པ་མེད་དོ། །ཐམས་ཅད་མཁྱེན་པའི་ལམ་ལ་འགོད་ཀྱང་ཞུམ་པར་བྱེད་པ་མེད་དོ། །ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་འཁྲུག་པ་མེད་དོ། །འཁོར་བའི་ཉེས་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་ཡོངས་སུ་གདུང་བ་མེད་དོ།
en: it brings them onto the path to happiness without being disheartened, brings them onto the path to omniscience without becoming despondent, is undisturbed by any kleśas, and is not afflicted by any of the harms of saṃsāra.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན། སྒྱུ་མའི་རྣམ་པ་ལས་གྲུབ་པའི་མི་ཡན་ལག་དང་ཉིང་ལག་ཤིན་ཏུ་ཚང་བ་ལ་ལུས་ལ་གནས་པའི་ཆོས་བཅུ་མེད་དེ།
en: “Noble one, it is like the analogy of a man, with all the larger and smaller parts of the body complete, who is a magical conjuration and in whose body ten qualities are absent.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དབུགས་ནང་དུ་རྒྱུ་བའམ། དབུགས་ཕྱིར་རྒྱུ་བ་འམ། གྲང་བའམ། དྲོ་བའམ། བཀྲེས་པའམ། སྐོམ་པའམ། དགའ་བའམ།
en: What are those ten?

source: མི་དགའ་བའམ། སྐྱེ་བའམ། རྒ་བའམ། ན་བའམ། འཆི་བ་དང་། གནོད་པར་འགྱུར་བ་མེད་དོ།
en: They are (1) inhalation, ( ) exhalation, (3) cold, (4) warmth, (5) hunger, (6) thirst, (7) happiness, (8) unhappiness, (9) birth, aging, sickness, and death, and (10) injury.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པ་ལས་བྱུང་བའི་གཟུགས་དང་ལྡན་པ།
en: “Noble one, in the same way, bodhisattvas have forms that emerge as the magical conjuration of wisdom;

source: ཆོས་ཀྱི་དབྱིངས་ཐ་མི་དད་པའི་ལུས་དང་ལྡན་པ། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱེད་པའི་དོན་དུ་སྐྱེས་ཏེ།
en: they have bodies that are not separate from the realm of the Dharma, and which are born in order to ripen all beings in the classes of existence within saṃsāra.

source: བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པ་ལའང་ཆོས་བཅུ་མེད་དེ།
en: “Although they are present in all kalpas, there are ten qualities that they do not have.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་འཁོར་བ་ལ་མངོན་པར་དགའ་བའམ།
en: What are those ten?

source: འཁོར་བ་སྲིད་པའི་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་བས་སྐྱོ་བར་འགྱུར་བའམ། ཡུལ་གྱི་དགའ་བ་ལ་འདུན་པའམ། ཁོང་ཁྲོ་བའི་སེམས་སམ། ལོངས་སྤྱོད་པར་འདོད་པའམ། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གདུང་བ་འམ། སྡུག་བསྔལ་གྱི་ཚོར་བ་ཉམས་སུ་མྱོང་བའམ། ལམ་ཉམ་ང་བར་སྐྱེ་བས་འཇིགས་པའམ།
en: They are (1) delight in saṃsāra, ( ) sadness on being reborn within a class of existence within saṃsāra, (3) dedication to the pleasures of the senses, (4) an angry mind, (5) desire for enjoyments, (6) being afflicted by all the kleśas, (7) experiencing the sensation of suffering, (8) fear through being born in frightening existences, (9) yearning for an existence, and (10) clinging to an existence.

source: སྲིད་པར་མངོན་པར་འདུན་པའམ། མངོན་པར་ཆགས་པ་མེད་དོ། །འོན་ཀྱང་རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྒྱ་ཆེན་པོའི་སྟོབས་རྣམ་པར་འཕེལ་བར་བྱ་བའི་ཕྱིར་བསྟན་པར་བྱའོ།
en: “However, noble one, I shall also teach, through the blessing of the buddhas, in order to increase the power of the vast bodhisattva prayers of future bodhisattvas.

source: །རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་བ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་དེའི་ཡང་ཕ་སྔ་འདས་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན། འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་འོད་ཅེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “Noble one, in the past, in times gone by, beyond as many kalpas as there are atoms in an ocean of world realms, and even further beyond, there was at that time, in that time, a world realm called Ratnaprabhā

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་འོད་དེ་ལ་བསྐལ་པ་ནི་འོད་བཟང་པོ་ཞེས་བྱ་བ་བྱུང་ངོ་།
en: “Noble one, in that world realm called Ratnaprabhā there was kalpa called Suprabha

source: །བསྐལ་པ་འོད་བཟང་པོ་ཞེས་བྱ་བ་དེ་ལ་ནི་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་བྱུང་བར་གྱུར་ཏེ།
en: In that kalpa called Suprabha there appeared ten thousand buddhas.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་ལས་བསྐལ་པའི་དང་པོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མ་རྒྱལ་པོ་ཞེས་བྱ་བ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་བསྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Noble one, the first of those ten thousand buddhas in that kalpa who appeared in that world was the Tathāgata Arhat Samyak­saṃbuddha Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, who was one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, and a bhagavat.

source: དེ་ཐམས་ཅད་ཀྱི་ཐོག་མ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ།
en: He was the first of them all to attain the highest, complete enlightenment of buddhahood.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དེ་གླིང་བཞི་བའི་དབུས་ན་རྒྱལ་པོའི་གནས་དགའ་བས་བརྒྱན་པ་ཞེས་བྱ་བ་ཡོད་པ་དང་། ཚོད་དུ་ཡང་རྒྱང་མི་རིང་བ་ཞིག་བྱུང་སྟེ།
en: “Noble one, that tathāgata appeared not far from the royal capital named Rativyūhā in the central four-continent world.

source: རྒྱལ་པོའི་གནས་དགའ་བས་བརྒྱན་པ་དེའི་ཤར་ཕྱོགས་ལོགས་ན། ནགས་ཚལ་འོད་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: To the east of the royal capital Rativyūhā, there was a forest called Suprabha

source: ནགས་ཚལ་འོད་བཟང་པོ་དེར་སྙིང་པོ་བྱང་ཆུབ་རིན་པོ་ཆེའི་མེ་ཏོག་གི་སྤྲིན་ཅེས་བྱ་བ་བྱུང་ངོ་།
en: In Suprabha Forest there was a bodhimaṇḍa called Ratna­kusuma­megha.

source: །སྙིང་པོ་བྱང་ཆུབ་རིན་པོ་ཆེའི་སྤྲིན་ཅེས་བྱ་བ་དེར་གདན་སེང་གེའི་ཁྲི་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་སྙིང་པོ་ཅན་བྱུང་སྟེ། དེ་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མ་རྒྱལ་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ།
en: At that bodhimaṇḍa called Ratna­kusuma­megha there appeared a lion throne on which there was a shining jewel lotus. It was upon this that the Tathāgata Arhat Samyak­saṃbuddha Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja attained the highest, complete enlightenment of buddhahood.

source: །དེའི་ཚེ་མིའི་ཚེའི་ཚད་ལོ་སྟོང་ཕྲག་བཅུ་ཐུབ་པ་ལས་འཇིག་རྟེན་དུ་སེམས་ཅན་སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་ཟེར་བ་དང་། ཞེ་གཅོད་པའི་ཚིག་སྨྲ་བ་དང་། ཚིག་ཁྱལ་པ་ཟེར་བ་དང་། ཆགས་སེམས་དང་ལྡན་པ་དང་། གནོད་སེམས་ཡོད་པ་དང་། ལོག་པར་ལྟ་བ་ཅན་བྱུང་སྟེ། དེ་ལྟར་མི་དགེ་བའི་ལས་ཀྱི་ལམ་བཅུ་རྣམ་པར་རྒྱས་པར་གྱུར་ནས་རབ་ཏུ་བརྟན་པར་གྱུར་ཏེ།
en: “At that time, in that time, the lifespan of humans was ten thousand years, but there occurred killing, stealing, sexual misconduct, lying, slander, harsh speech, meaningless talk, avariciousness, maliciousness, and wrong views, and in that way the path of the ten bad actions became widespread and enduring.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མ་རྒྱལ་པོ་དེས་འཇིག་རྟེན་གྱི་དབང་པོའི་སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པ་རྣམས་དང་། འཛམ་བུ་གླིང་གི་མྱི་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་ཕྱིར་སྙིང་པོ་བྱང་ཆུབ་མཆོག་ཏུ་གཤེགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་བསྟན་ཏོ། །དེའི་ཚེ་རྒྱལ་པོའི་གནས་དགའ་བས་བརྒྱན་པ་དེ་ན་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ཅེས་བྱ་བ་འདུག་འདུག་སྟེ། དེས་མི་མ་བྱིན་པར་ལེན་པ། རྐུ་བ། སྡིག་ཏོ་བྱེད་པ། སྲོག་གཅོད་པ། འདོད་པས་ལོག་པར་གཡེམ་པ། བརྫུན་ཟེར་བ། ཕྲ་མ་སྨྲ་བ། ཞེ་གཅོད་པའི་ཚིག་དང་ལྡན་པ། ཚིག་ཁྱལ་བ་སྨྲ་བ། ཆགས་སེམས་ཅན་གནོད་སེམས་ཡོད་པ། ལོག་པར་ལྟ་བ། ཆོས་མ་ཡིན་པའི་འདོད་ཆགས་ལ་ཞེན་པ། འདོད་པ་མི་བཟད་པས་མངོན་པར་ནོན་པ། ལོག་པའི་ཆོས་ཀྱིས་ཀུན་ནས་འཁོར་བ། སྡིག་ཏོ་བྱེད་བྱེད་པ། ཁྲོ་གཏུམ་བྱེད་བྱེད་པ། བསོད་ནམས་མ་བྱས་པ། འཇིགས་པས་བག་ཚ་བ་མེད་པ། མར་མི་ཤེས་པ། ཕར་མི་ཤེས་པ། དགེ་སྦྱོང་དུ་བྱ་བ་མེད་པ། བྲམ་ཟེར་བྱ་བ་མེད་པ།
en: “The Bhagavat Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja remained at the bodhimaṇḍa, teaching the Dharma to bodhisattvas, in order to ripen the roots of merit of the lords of the world and Jambudvīpa humans who had served past jinas.

source: ཚུལ་མི་ཤེས་པ་གཡོན་དང་ལྡན་པ་བརྒྱ་སྟོང་དུ་མ་རབ་ཏུ་གདུལ་བར་བྱ་བའི་ཕྱིར་བཙོན་རར་བཙུད་པར་གྱུར་ཏོ།
en: “At that time, in that time, in the royal capital Rativyūhā, there lived King Jayaprabha, who in order to subdue them imprisoned many hundreds of thousands of people who had stolen, robbed, performed criminal acts, killed, performed sexual misconduct, lied, slandered, spoken harshly, and talked meaninglessly, who were avaricious, were malicious, held wrong views, were attached to desires contrary to the Dharma, were overwhelmed by irresistible desires, were encompassed by wrong Dharma, and who committed sinful actions, acted wrathfully, did not create merit, did not save those who were in fear, did not respect their mothers, did not respect their fathers, were not reverential to mendicants, were not reverential to brahmins, were not respectful of āryas, and committed transgressions.

source: །རྒྱལ་པོ་རྒྱལ་བའི་འོད་དེ་ལ་བུ་གཟུགས་བཟང་བ་ཤིན་ཏུ་མཛེས་པ་བལྟ་ན་སྡུག་པ།
en: “King Jayaprabha had a son whose name was Vijitāvin. He was handsome, attractive, a delight to see, and he had a very beautiful, perfect, magnificent complexion.

source: ཁ་དོག་བཟང་པོ་དམ་པ་རྒྱས་པ་དང་ལྡན་པ་མི་ཆེན་པོའི་མཚན་ཉི་ཤུ་རྩ་བརྒྱད་དང་ལྡན་པ།
en: He had twenty-eight of the signs of a great being.

source: རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེ། ཁང་པ་གླུ་སྙན་པའི་དབྱངས་ཞེས་བྱ་བའི་སྟེང་དུ་ཕྱིན་ཏེ། བུད་མེད་ཀྱི་འཁོར་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་འདུག་འདུག་པ་ལས་བཙོན་ར་ན་འཁོད་པའི་སེམས་ཅན་མཚོན་ཆ་སྣ་ཚོགས་ཀྱིས་དམ་དུ་གླགས་པ།
en: He went up on the roof of the palace called Sarasvati­saṃgīti, where he stayed, encircled by an entourage of many women.

source: དེ་དག་གི་སྒྲ་འཇིགས་འཇིགས་སྐད་དུ་འབོད་པ་ཐོས་པར་གྱུར་ཏོ།
en: He heard the terrified cries of the beings who had been put into prison and were tightly bound by various instruments.

source: །ཐོས་ནས་མི་དགའ་ཞིང་ཤིན་ཏུ་ཉམས་མི་བདེ་བའི་སེམས་སུ་གྱུར་ཏེ།
en: On hearing them he became unhappy, and his mind was not at ease.

source: སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་ནས་ཁང་སྟེང་དེ་ནས་ཤོད་དུ་བབས་ཏེ།
en: Great compassion arose in him, and he descended from the roof of the palace.

source: བཙོན་ར་དེར་ཕྱིན་ནས་བཙོན་ར་དམ་པོ་ན་འཁོད་པའི་སེམས་ཅན་ཤིང་སྒྲོག་དང་ལྕགས་སྒྲོག་དང་། ཁོང་སྒྲིལ་དང་། ལྟུང་དང་མདོ་རྟོད་ཀྱིས་བསྒྲོགས་ཤིང་བརྟོད་དེ་གཅིག་གི་ལུས་དང་གཅིག་ཏུ་སྦྲེལ་ནས་མུན་པ་མུན་ནག་ཏུ་བཙུད་དེ། དུད་པའི་རབ་རིབ་ཀྱིས་འགྲིགས་ཤིང་།
en: He entered the prison and inside that strict prison saw the beings who in darkness were imprisoned, bound in wooden stocks, chains, manacles, and fetters and chained one to another.

source: རླུང་ནད་ཉམས་སུ་མྱི་བདེ་བས་ཉམ་ཐག་པར་གྱུར་པ། དབུགས་ཤིན་ཏུ་མི་བདེ་བ་རྒྱུ་བ་བཀྲེས་པ་དང་། སྐོམ་པས་མནར་བ། སྒྲེན་མོ་གོས་མེད་པ་ལུས་ཐམས་ཅད་ཕྱག་དར་དང་རྡུལ་གྱི་ནང་ན་འགྲེ་བ། ལུས་རང་གིས་སྐྲས་ཡོག་པ། བརླ་སྒྲིལ་གྱིས་དམ་དུ་བཅིངས་པ།
en: It was thick with blinding smoke, and they were stricken by unpleasant sickening air, breathing with difficulty, tormented by hunger and thirst, and naked, without clothes, their bodies entirely covered in dirt and dust, their bodies covered by their own hair, their thighs tightly bound together;

source: ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱིས་ཐོ་བཙམས་པ་སྡུག་བསྔལ་གྱི་ཚོར་བས་ཟིལ་གྱིས་མནན་ཅིང་། སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་གྱུར་ཏེ། མི་བཟད་པ་སྣ་ཚོགས་ཀྱི་སྨྲེ་སྔགས་ཀྱིས་བླ་ཞིང་འོ་དོད་འབོད་པ་དེ་དག་མཐོང་ནས་སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་ཏེ།
en: they were overwhelmed by a sensation of the suffering of a series of various torments, and in their suffering they cried out with unendurable wailing and screams.

source: སྙིང་རྗེའི་བསམ་པ་རྒྱ་ཆེན་པོ་བྱུང་ནས་གཞན་ལ་ཕན་པར་བྱ་བའི་སེམས་སྐྱེས་ཏེ།
en: “When he saw this, a great compassion arose in him along with a motivation to help others.

source: བཙོན་རའི་ཐིབས་པོ་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་བཙོན་ར་ནས་ཐར་བར་བྱའོ། །ཞེས་དབུགས་བཏོན་ནས་དེས་སེམས་ཅན་དེ་དག་མི་འཇིགས་པ་བྱིན་ཏེ།
en: He reassured them, saying, ‘I will free from prison all those who have been placed in the darkness of this prison,’ thus giving them the gift of freedom from fear.

source: རྒྱལ་པོ་རྒྱལ་བའི་འོད་གང་ན་བ་དེར་སོང་སྟེ། འདི་སྐད་ཅེས་གསོལ་ཏོ། །ལྷའི་ཞལ་སྔ་ནས་མཁྱེན་པར་མཛད་ཏུ་གསོལ།
en: “He went to King Jayaprabha and said to him, ‘Your Majesty, I request your attention.

source: བཙོན་ར་མི་བདེ་བ་ན་མཆིས་པའི་སེམས་ཅན་རྣམས་ལ་གློ་བ་རྗེས་ནས་བདག་གིས་མི་འཇིགས་པ་སྩལ་ན་དེ་དག་དགྱེ་བར་ཅི་གནང་ཞེས་ནས།
en: Taking pity on those beings who are in the unhappiness of being imprisoned, I have given them the assurance of freedom from fear. Please release them.’

source: དེ་ནས་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ཀྱིས་བློན་པོ་ལྔ་བརྒྱ་པོ་བསྩོགས་ནས་ཁྱེད་ཇི་སྙམ་དུ་སེམས་ཞེས་སྨྲས་པ་དང་། དེ་དག་གིས་སྨྲས་པ།
en: “King Jayaprabha gathered together his five hundred ministers and asked them, ‘What do you think?’

source: བཙོན་འདི་རྣམས་ནི་རྒྱལ་པོའི་ཕྱག་མཛོད་རྐུ་བ། རྒྱལ་པོའི་སྐུ་ལ་དར་བ། བཙུན་མོའི་འཁོར་དུ་ཞུགས་པ་ལས་བཟུང་བ་ཤ་སྟག་སྟེ།
en: “They said, ‘All these prisoners have stolen from the king’s treasuries, have attempted to harm the king, have trespassed into your harem, and so on.

source: དེ་དག་ནི་མི་དགུམ་དུའང་མི་རུང་།
en: They should be executed.

source: དེ་དག་གི་ཆད་པ་ནི་དགུམ་པས་འབྲ་བར་བས་ཏེ། མ་ལགས་ནའང་བཙོན་རར་གུམ་ན་ཆད་པ་འབྲ་ལགས་གྲང་།
en: Their punishment should be execution or to die in chains.

source: དེ་དག་གི་མགོན་སུ་བགྱིད་པ་དེའང་རྒྱལ་པོའི་ཞལ་སྔར་གློ་བ་རིང་ངོ་།
en: Someone who undertakes to help them is committing a crime against the king.’

source: །དེ་ནས་རྒྱལ་པོའི་བུ་རྣམ་པར་རྒྱལ་བ་སྙིང་རྗེ་ཆེན་པོས་མི་བཟོད་ཅེས་ནས་བློན་པོ་དེ་དག་ལ་སྨྲས་པ། ཁྱོད་ཀྱིས་ཇི་སྐད་དུ་སྨྲས་པ། དེ་ལྟར་ཡང་རུང་སྟེ།
en: “Prince Vijitāvin, giving rise to an overwhelming compassion, said to those ministers, ‘Let it be as you have just said.

source: ངས་ཁོང་ཏ་འདི་དག་གི་དོན་དུ་སྡུག་བསྔལ་ཉམས་སུ་བླངས་པ་ཐམས་ཅད་ཀྱང་བཟོད་པར་བྱ་ན་དེ་དག་ལ་ཁྱོད་ཀྱིས་ཅི་བྱ།
en: I will endure all their experiences of suffering for their sake.

source: དེ་ང་ལ་གྱིས་ཏེ་ཉེས་པ་ཅན་དེ་དག་ཁྱེ་ཤིག །ངས་དེ་རྣམས་བཙོན་ར་ནས་དགྲོལ་བའི་དོན་དུ་མི་བདེ་བ་ཐམས་ཅད་ཉམས་སུ་བླངས་ཏེ།
en: Do to me whatever you would do to them and set them free! I will undergo every kind of unhappiness in order to free them from prison.

source: ལུས་དང་སྲོག་ཡོངས་སུ་དོར་བར་བྱའོ།
en: I will even give up my body and life.

source: གལ་ཏེ་ངས་སེམས་ཅན་འདི་རྣམས་ཙམ་ཞིག་ཀྱང་བཙོན་ར་ནས་དགྲོལ་བར་མ་ནུས་ན་ཁམས་གསུམ་པའི་བཙོན་ར་ན་འཁོད་པའི་སེམས་ཅན་སྲེད་པའི་ཞགས་པས་གླགས་པ། མ་རིག་པའི་ཐིབས་པོ་ན་འཁོད་པ། གཏི་མུག་གི་མུན་པར་བཙུད་པ། ཕོངས་པའི་སྡུག་བསྔལ་གྱིས་མནར་བ་ངན་སོང་གི་རྒྱུད་ཟབས་སུ་རིང་ཞིང་འབྱུང་བར་དཀའ་བར་ཆུད་པ། དབྱིབས་མི་སྡུག་ལ་མདོག་མི་སྡུག་པ་དང་ལྡན་པ། དབང་པོའི་སྦྱོར་བ་ཐམས་ཅད་དང་བྲལ་བ། ནོར་བའི་ཡིད་དང་ལྡན་པ། འབྱུང་བ་མི་མཐོང་བ་སྣང་བ་མེད་པ་ཁམས་གསུམ་པ་ལ་མངོན་པར་ཞེན་པ། བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་མྱེད་པ། ཡེ་ཤེས་ཀྱི་སྐྱེ་མཆེད་དང་སྐོལ་བ་ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱིས་སེམས་དྲི་མ་ཅན་དུ་གྱུར་པ། སྡུག་བསྔལ་གྱི་ཤིང་ཐགས་ཀྱིས་འཁོར་བ་དང་། བདུད་ཀྱི་དབང་དུ་གྱུར་པ། སྐྱེ་བ་དང་རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་ཡིད་མྱི་བདེ་བ་དང་། འཁྲུག་པས་མནར་བ་རྣམས་ཀྱང་ཇི་ལྟར་ཁྲོལ་བར་བྱ་ཞེས་ནས།
en: If I am unable to free even these beings from prison, how would I be able to liberate beings who are imprisoned in the three realms, who are bound by the noose of craving, who are within the darkness of ignorance, who have been cast into the darkness of stupidity, who are tormented by the suffering of poverty, who are distressed in the deep abyss of the lower existences, whose bodies have unpleasant shapes and ugly color, who are lacking in the functioning of the senses, who have bewildered minds, who do not see a way out of saṃsāra, who are devoid of light, who cling to the three realms, who lack the accumulations of merit and wisdom, who are deprived of a basis for wisdom, whose minds are stained by various kleśas, who are trapped in an enclosure of suffering, who are under the power of Māra , and who are tormented by birth, aging, sickness, death, misery, wailing, suffering, unhappiness, and tribulation?’

source: རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་བཙོན་ར་ན་འཁོད་པའི་སེམས་ཅན་དེ་དག་བདག་ཉིད་ཡོངས་སུ་གཏང་བ་དང་། རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་གཏང་བས། གཡོག་འཁོར་ཐམས་ཅད་དང་། ནོར་གྱི་ཕུང་པོ་ཐམས་ཅད་ཀྱིས་བླུས་ཏེ། བརྩོན་ར་དེ་དག་ནས་ཡོངས་སུ་བཀྱེ་ནས་སེམས་ཅན་དེ་དག་གི་སྡུག་བསྔལ་ཉམས་སུ་བླངས་ཏེ།
en: “Prince Vijitāvin could not be dissuaded from freeing those imprisoned beings by offering up himself, by offering everything, and by ransoming them with his entourage and all his accumulation of wealth, and then taking on the suffering of those beings.

source: ཕྱིར་ལྡོག་པ་མྱེད་པར་གྱུར་ཏོ། །དེ་ནས་བློན་པོ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ལག་པ་གྱེན་དུ་བསྒྲེང་སྟེ། འོ་དོད་བོས་ནས་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ཀྱི་གན་དུ་སོང་སྟེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོའི་ཞལ་སྔ་ནས་མཁྱེན་པར་མཛད་དུ་གསོལ། གཞོན་ནུ་རྣམ་པར་རྒྱལ་བའི་མཆིད་ཐབས་སུ་བགྱིས་པས།
en: “Then the five hundred ministers, wailing with their arms upraised, went to King Jayaprabha and said to him, ‘Your Majesty, we request attention.

source: རྒྱལ་པོའི་ཆབ་སྲིད་ཀྱང་སྟོར་བར་འགྱུར། བདག་ཅག་རྣམས་ཀྱང་སྲོག་ལ་འབབ་པར་ཐེ་ཚོམ་འཚལ་ཏེ།
en: Prince Vijitāvin’s plans will destroy the kingdom! We are even concerned for our own lives!

source: ལྷའི་ཞལ་སྔ་ནས་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་ལ་བཀའ་ནན་མ་མཛད་ན་ནི། རིང་པོ་ཡང་མྱི་ཐོགས་པར་ལྷའི་ཞལ་སྔར་སྐུ་ལ་དར་བར་འགྱུར་རོ་ཞེས་པ་དང་། དེ་ནས་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ཤིན་ཏུ་ཁྲོས་ནས།
en: If Your Majesty does not restrain the prince, before long Your Majesty’s life will be taken from you!’

source: རྒྱལ་པོའི་བུ་རྣམ་པར་རྒྱལ་བ་དང་། གཡོན་དང་ལྡན་པའི་མྱི་དེ་དག་དུ་བཅས་ཏེ་གསད་པར་བྱས་སོ། །དེ་ནས་དེའི་མ་སྐྱེད་སྐྱེད་པས་ཐོས་ནས་མྱི་དགའ་སྟེ།
en: “Then King Jayaprabha became angry and condemned to death Prince Vijitāvin and all those people who were criminals.

source: བུད་མྱེད་ཀྱི་འཁོར་སྟོང་དང་བཅས་ཏེ། སྐྲ་ནི་བཤིག །ལུས་ཀྱི་རྒྱན་ནི་བོར་རང་གི་བཞིན་ནི་དྲལ། བྲང་ནི་བརྡུང་མགོ་ནི་ཕྱག་དར་གྱིས་གང་བར་སྙིང་རྗེ་རྗེ་སྐད་ཀྱི་ང་རོར་ངུ་ཞིང་རྒྱལ་པོའི་དྲུང་དུ་ཕྱིན་ནས། འཁོར་དང་བཅས་པས་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ཏེ། འདི་སྐད་དུ་གསོལ་བ་བཏབ་པོ།
en: “When his birth mother heard this, she was distressed and, with her entourage of a thousand women with their hair in disarray, their jewelry cast aside, and their faces scratched, beating their breasts, with their heads covered with dirt, and wailing with piteous cries, came into the presence of the king, and she and her entourage bowed down at his feet and made this supplication:

source: །ལྷའི་ཞལ་སྔ་ནས་ཐུགས་ཅི་དགོངས།
en: ‘Your Majesty, listen to our plea!

source: རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་གཏང་དུ་གསོལ།
en: Free Prince Vijitāvin!

source: རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བའི་སྲོག་སྩལ་དུ་གསོལ་ཞེས་ནས།
en: Spare the life of Prince Vijitāvin!’

source: དེ་ནས་རྒྱལ་པོས་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་མདུན་དུ་བཞག་སྟེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་གཡོན་དང་ལྡན་པའི་མྱི་འདི་རྣམས་ཐོང་།
en: “Then the king had Prince Vijitāvin brought before him and said to him, ‘Prince, abandon those people who are criminals!

source: དེ་སྟེ་མྱི་གཏོང་ཞིང་དེ་རྣམས་ཀྱི་ལེ་ལན་དུ་ཤི་བར་གྱུར་ཏ་རེ་ཞེས་པ་དང་། དེས་ཞུམ་པ་མྱེད་པའི་སེམས་མ་འཁུམས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམྱིགས་པར་བརྩོན་པ།
en: If you do not abandon them, you will be executed in their stead!’

source: གཞན་ལ་ཕན་པར་གཞོལ་བ།
en: “The prince was not disheartened or discouraged but was engaged in attaining the goal of omniscience, was dedicated to benefiting others, was led in all his actions by compassion, and accepted his death.

source: སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བས་འཆི་བར་ཁས་བླངས་པ་དང་། དེའི་མས་རྒྱལ་པོ་རྒྱལ་བའི་འོད་ལ་ཟླ་བ་ཕྱེད་ཅིག་ཏུ་ཕྲད་པར་གསོལ་བ་བཏབ་པ། དགུང་ཟླ་ཕྱེད་གཅིག་ཏུ་གཞོན་ནུ་འདི་སྦྱིན་པ་སྩོལ་དུ་ཅི་གནང་།
en: “His mother requested King Jayaprabha to give him half a month, saying, ‘I request that this prince be allowed to perform acts of charity for half a month, and after that you may do as you wish.’

source: དེ་སླན་ཅད་ནི་སུ་ཅི་དགྱེས་པ་དེའང་མཛད་པར་གསོལ་ཞེས་པ་དང་། དེ་དེ་ལྟར་གྱིས་ཤིག་ཅེས་རྒྱལ་པོས་གནང་ངོ་།
en: “The king gave his permission, saying, ‘Let it be so!’

source: །དེ་ནས་རྒྱལ་པོའི་གནས་དགའ་བས་བརྒྱན་པ་དེའི་བྱང་ཕྱོགས་ལོགས་ཤིག་ན། སྔོན་མཆོད་སྦྱིན་གྱི་གནས་སུ་བྱ་བའི་བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་ཉི་མའི་འོད་ཅེས་བྱ་བ་དེར་གཞོན་ནུ་དེ་སོང་ནས།
en: “The prince went to the great park called Sūrya­prabha , which was to the north of Rativyūhā, the royal capital, and was the traditional location for offerings and acts of charity.

source: སུ་ཅི་འདོད་པ་དེ་ལ་དེ་བྱིན་ཏེ། དེས་གཏན་པ་མྱེད་པའི་མཆོད་སྦྱིན་བྱས་ནས་ཟླ་བ་ཕྱེད་དུ་སྦྱིན་པ་རྣམ་པ་སྣ་ཚོགས་བྱིན་ཏེ།
en: There the prince gave anyone whatever they wanted, making unconditional offerings and gifts of every kind for half a month.
